Repository: dupgit/heraia
Catalog: po/*.po
Languages: fr

source: heraia written by %s %s - Version %s License %s
fr: heraia écrit par %s %s - Version %s Licence %s

source: Try `heraia --help' for more information.
fr: Essayer heraia --help pour plus d'information

source: heraia is a simple hexadecimal file editor and file analyser
fr: heraia est un éditeur et un analyseur hexadecimal de fichiers

source: Usage : heraia [options] filename(s)
fr: Usage : heraia [options] fichier(s)

source: -h, --help This help.
fr: -h, --help Cette aide.

source: -v, --version Program version information.
fr: -v, --version Donne la version du programme.

source: -t, --tests=TESTS Runs some tests.
fr: -t, --tests=TESTS Execute certains tests.

source: TESTS might be :
fr: Les TESTS peuvent être :

source: %d for coverage tests
fr: %d pour les tests de couverture

source: %d for loading files tests
fr: %d pour les tests de chargement de fichiers

source: Main structure could not be initialiazed !
fr: La structure principale n'a pu être initialisée !

source: Do you have a memory problem ?
fr: Avez vous un problème mémoire ?

source: Enabling plugins
fr: Mise en route des greffons

source: Inits the plugin list window
fr: Initialisation de la fenêtre listant les greffons

source: Plugins will be disabled
fr: Les greffons ne seront pas disponibles

source: Gettext package : %s
fr: Paquet gettext : %s

source: WARNING : tmp_struct is not equal to main_struct!
fr: Avertissement : tmp_struct n'est pas égale à main_struct

source: WARNING : Error while testing decode functions
fr: Avertissement : Erreur lors des tests des fonctions de décodage

source: Main struct initialized !
fr: Main struct initialisée !

source: Beginning things
fr: Le début des choses

source: Main interface loaded
fr: Interface principale chargée

source: Preference file is %s
fr: Le fichier des préférences est : %s

source: data interpretor's tab is %d
fr: L'onglet de l'interpréteur de données est %d

source: File heraia.gtkbuilder not found !
fr: Le fichier heraia.gtkbuilder n'a pas été trouvé !

source: Libheraia library test OK
fr: Test de la bibliothèque libheraia OK

source: Unable to open and create the main preference file %s
fr: Impossible d'ouvrir et créer le fichier des préférences principales nommé %s

source: Main preference file %s created successfully
fr: Fichier des préférences principal %s crée avec succès

source: Not implemented Yet (Please contribute !)
fr: Fonction non encore implémentée (Contribuez s'il vous plaît !)

source: Error while saving file %s !
fr: Erreur pendant l'enregistrement du fichier %s !

source: Saving file as... : operation cancelled.
fr: Enregister sous... : opération annulée.

source: Error while saving file as %s
fr: Erreur pendant l'enregistrement du fichier sous le nom %s

source: File %s saved and now edited.
fr: Fichier %s enregistré et maintenant édité.

source: All tests went Ok.
fr: Tous les test se sont bien déroulés.

source: Some tests failed.
fr: Quelques tests on échoués.

source: Select a file to analyse
fr: Sélectionnez un fichier à analyser

source: Save As...
fr: Enregistrer sous...

source: Changing color for filename %s in tab : %d
fr: Changement de la couleur pour le fichier nommé %s dans l'onglet n° %d

source: Connecting heraia_ui signals
fr: Connexion des signaux d'heraia_ui

source: [Done]
fr: [Fait]

source: log window init interface
fr: Initialisationn de l'interface de la fenêtre de log

source: preferences window init interface
fr: Initialisation de l'interface de la fenêtre des préférences

source: data interpretor init interface
fr: Initialisation de l'interface de l'interpréteur des données

source: Loading heraia preference file
fr: Chargement des préférences d'Heraia

source: [FAILED]
fr: [ECHEC]

source: Setting up preferences
fr: Mise en place des préférences

source: Unsaved document(s) remains.
fr: Il reste des documents non enregsitrés

source: Do you want to quit without saving ?
fr: Voulez vous quitter sans les enregsitrer ?

source: Can't convert output to the locale: %s
fr: Impossible de convertir la sotie à la locale : %s

source: %s - RECURSION: %s %c
fr: %s - RÉCURSION : %s %c

source: %s - ERROR: %s %c
fr: %s - ERREUR : %s %c

source: %s - CRITICAL: %s %c
fr: %s - CRITIQUE : %s %c

source: %s - WARNING: %s %c
fr: %s - AVERTISSEMENT : %s %c

source: %s - DEBUG: %s %c
fr: %s - DÉBOGAGE : %s %c

source: Could not open plugin %s - %s
fr: Impossible d'ouvrir le greffron %s - %s

source: plugin %s loaded.
fr: Greffon %s chargé

source: filename to load : %s
fr: Fichier à charger : %s

source: file %s loaded !
fr: Fichier %s chargé !

source: Error while trying to load file %s
fr: Erreur pendant le chargement du fichier %s

source: The file %s is empty !
fr: Le fichier %s est vide !

source: The file %s does not exist !
fr: Le fichier %s n'existe pas !

source: Couldn't load builder file: %s
fr: Impossible de charger le fichier builder : %s

source: Something's wrong!
fr: Quelque chose ne va pas !

source: Cannot interpret as a %d byte(s)
fr: Impossible d'interpréter comme %d Octet(s)

source: Numbers
fr: Nombres

source: Length
fr: Taille

source: Value unsigned
fr: Valeur non signée

source: Value signed
fr: Valeur signée

source: Can not interpret %d byte as a 8 bits number
fr: Impossible d'interpréter %d octet comme un nombre sur 8 bits

source: Can not interpret %d bytes as a 16 bits number
fr: Impossible d'interpréter %d octet comme un nombre sur 16 bits

source: Can not interpret %d bytes as a 32 bits number
fr: Impossible d'interpréter %d octet comme un nombre sur 32 bits

source: Can not interpret %d bytes as a 64 bits number
fr: Impossible d'interpréter %d octet comme un nombre sur 64 bits

source: Floats
fr: Flottants

source: Normal Notation
fr: Notation normale

source: Exponential notation
fr: Notation exponentielle

source: Float (32 bits)
fr: Flottant (32 bits)

source: Can not interpret %d bytes as a float number
fr: Impossible d'interpréter %d octets comme un nombre flottant

source: Can not interpret %d bytes as a double number
fr: Impossible d'interpréter %d octets comme un double

source: Dates and Times
fr: Dates et heures

source: Value
fr: Valeur

source: Can not interpret %d bytes as a DOS date
fr: Impossible d'interpréter %d octets comme une date de type DOS

source: Can not interpret %d bytes as a filetime date
fr: Impossible d'interpréter %d octets comme une date de type FILETIME

source: Can not interpret %d bytes as a C date
fr: Impossible d'interpréter %d octets comme une date de type C

source: Can not interpret %d bytes as a HFS date
fr: Impossible d'interpréter %d octets comme une date de type HFS

source: Binary based
fr: Binaires

source: Can not decode %d byte(s) to bits
fr: Impossible de décoder %d octets en bits

source: Packed BCD
fr: BCD compressé

source: Can not interpret %d byte(s) as packed BCD string
fr: Impossible d'interpréter %d octets comme une chaine de type BCD compressé

source: Type : Unknown
fr: Type : Inconnu

source: Type : Filter
fr: Type : Filtre

source: Priority : %d
fr: Priorité : %d

source: Name : %s
fr: Nom : %s

source: Summary : %s
fr: Résumé : %s

source: Author : %s
fr: Auteur : %s

source: Web site : %s
fr: Site web : %s

source: The 'info' structure is not initialized !
fr: La structure 'info' n'est pas initialisée !

source: Plugin's defined functions :
fr: Fonctions du greffon :

source: - Initialization function : %p
fr: - Fonction d'initialisation : %p

source: - Main function : %p
fr: - Fonction principale : %p

source: - Exit function : %p
fr: - Fonction de sortie : %p

source: - Refresh function : %p
fr: - Fonction de rafraichissement : %p

source: This plugin does not provide any function !!
fr: Ce greffon ne fournit aucune fonction !!

source: Filter functions :
fr: Fonction de filtres :

source: - Import function : %p
fr: - Fonction d'import : %p

source: - Export function : %p
fr: - Fonction d'export : %p

source: This plugin does not provide any filter function
fr: Ce greffon ne fournit aucune fonction de filtre

source: The structure 'filter' is not initialized !
fr: La structure 'filter' n'est pas initialisée !

source: This plugin provides :
fr: Ce greffon fournit :

source: - a menu entry in the plugins menu.
fr: - Une entrée de menu dans le menu des greffons.

source: - no menu entry.
fr: - Aucune entrée de menu.

source: - an xml interface.
fr: - Une interface xml.

source: - no xml interface.
fr: - Pas d'interface xml.

source: API version : %d
fr: Version de l'API : %d

source: File : %s
fr: Fichier : %s

source: Directory : %s
fr: Dossier : %s

source: Handle : NONE <-- Is there anything normal ?
fr: Handle : AUCUN <-- Y a t'il quelque chose de normal ?

source: This plugin has an additionnal 'extra' structure (%p) sized %d bytes.
fr: Le greffon possède une structure aditionnelle 'extra' (%p) d'une taille de %d octets.

source: This plugin does not have any additionnal structure.
fr: Ce greffon n'a pas de structure aditionnelle.

source: Plugin's state :
fr: État du greffon :

source: Running
fr: En marche

source: Initialiazing or initialized
fr: En cours d'initialisation ou initialisé

source: Loaded
fr: Chargé

source: Creating itself
fr: Se créeant lui même

source: Exiting
fr: En train de quitter

source: Waiting
fr: En attente

source: Unknown
fr: Inconnu

source: WARNING : expected result was not good with %s
fr: AVERTISSEMENT : le résultat attendu n'est pas le bon avec %s

source: Initializing plugin %s
fr: Initialisation du greffon %s

source: Plugin from %s found !
fr: Greffon de %s trouvé !

source: %s xml interface loaded.
fr: Interface xml %s chargée.

source: Unable to load %s xml interface.
fr: Impossible de charger l'interface xml %s

source: Quitting %s
fr: Sortie de %s

source: Enter filename's to save the image to
fr: Entrez le nom du fichier où enregistrer l'image

source: Enter filename to export data as CSV to
fr: Entrez le nom du fichier où exporter les données au format CSV

source: "Byte";"Count"
fr: "Octet";"Nombre"

source: "Byte/Byte";
fr: "Octet/Octet";

source: Enter filename to export data as gnuplot to
fr: Entrez le nom du fichier où exporter les données au format gnuplot

source: set title 'Classical histogram'
fr: set title 'Histogramme classique'

source: plot '-' title 'Byte count' with impulses
fr: plot '-' title 'Nombre d octets' with impulses

source: set title 'Heatmap histogram'
fr: set title 'Thermogramme'

source: Enter filename to export data as PCV to
fr: Entrez le nom du fichier où exporter les données au format PCV

source: title = "Classical histogram";
fr: title = "Histogramme classique";

source: integer b [label="Bytes"];
fr: integer b [label="Octets"];

source: integer c [label="Byte count"];
fr: integer c [label="Nombre d'octets"];

source: char a [label="Bytes"];
fr: char a [label="Octets"];

source: port c [label="Byte count"];
fr: port c [label="Nombre d'octets"];

source: char b [label="Bytes"];
fr: char b [label="Octets"];

source: Calculating stats on %s
fr: Calcul des statistiques sur %s

source: File size : %Ld bytes
fr: Taille du fichier : %Ld octets

source: Last intern modification : %s
fr: Dernière modification interne : %s

source: Last acces to the file : %s
fr: Dernier accès au fichier : %s

source: Last extern modification : %s
fr: Dernière modification externe : %s

source: 1D histogram statistics :
fr: Statistiques de l'histogramme 1D :

source: . mean : %lld
fr: . moyenne : %lld

source: . number of values : %lld
fr: . nombre de valeurs : %lld

source: 2D histogram statistics :
fr: Statistiques de l'histogramme 2D :

source: Histos calculated !
fr: Histogrammes calculés !

source: Main Preferences
fr: Préférences principales

source: Global Preferences
fr: Préférences globales

source: Display
fr: Affichage

source: Save windows's position
fr: Sauvegarder la position des fenêtres

source: use a blank separator for thousands
fr: Utiliser un blanc pour le séparateur des milliers

source: Left info pane
fr: Panneau d'information gauche

source: Data interpretor
fr: Interpréteur des données

source: Little endian
fr: Petit boutisme

source: Middle endian
fr: Moyen boutisme

source: Big endian
fr: Gros boutisme

source: Endianness
fr: Boutisme

source: stream size :
fr: Taille du flux :

source: Plugins list
fr: Liste des greffons

source: About Heraia
fr: À propos d'heraia

source: An hexadecimal analyser and editor
fr: Un analyseur et éditeur hexadécimal

source: Heraia web site
fr: Site web d'heraia

source: Log
fr: Journal

source: _File
fr: _Fichier

source: _Edit
fr: _Edition

source: _Display
fr: _Affichage

source: Data _Interpretor
fr: _Interpreteur des données

source: _Log
fr: _Journal

source: _Plugins
fr: _Greffons

source: _Help
fr: A_ide

source: Does run some self tests
fr: Fait tourner quelques auto-tests

source: <small>Selection :</small>
fr: <small>Sélection :</small>

source: <small>Selection size :</small>
fr: <small>Taille de la sélection :</small>

source: <small>File size :</small>
fr: <small>Taille du fichier :</small>

source: Numerical
fr: Numériques

source: Export datas to
fr: Exporter les données vers

source: Histograms
fr: Histogrammes
